[
    {
      "id": 1,
      "name": "Pointwest",
      "Web": "https://pointwest.com.ph",
      "facebook": "https://www.facebook.com/Pointwest.PH/",
      "twitter": "https://twitter.com/PointwestPH",
      "instagram": "https://www.instagram.com/pointwesthealth/",
      "intro": "Founded in 2003 serving the IT-BPM industry, Pointwest takes technology further and creates value for satisfied clients with world-class IT and BPM services backed by international standards, methodologies, and innovative practices. Pointwest specializes in digital transformation consulting & solutions, automation-enabled services, and application development modernization. We are committed to creating value for our clients and our employees through people-centricity, location independence, and resilient delivery.      ",
      "imagePath": "/pointwest-logo.png"
    },
    {
      "id": 2,
      "name": "PLDT & SMART",
      "Web": "https://pldthome.com/smarthome",
      "facebook": "https://www.facebook.com/PLDTHome/",
      "twitter": "https://www.twitter.com/pldthome/",
      "instagram": "https://www.instagram.com/pldthome/",
      "intro": "PLDT is the Philippines’ largest fully integrated telco company. Through its principal business groups – from fixed lines to wireless – PLDT offers a wide range of telecommunications and digital services across the Philippines’ most extensive fiber optic backbone, and fixed line and cellular networks. PLDT is listed on the Philippine Stock Exchange (PSE:TEL) and its American Depositary Shares are listed on the New York Stock Exchange (NYSE:PHI). PLDT has one of the largest market capitalizations among Philippine­ listed companies.",
      "imagePath": "/pldt-smart-logo.png"
    },
    {
      "id": 3,
      "name": "KooApps",
      "Web": "https://kooapps.com",
      "facebook": "https://www.facebook.com/KooappsPhilippines/",
      "twitter": "https://twitter.com/kooapps",
      "instagram": "https://www.instagram.com/kooappsgames/",
      "intro": "Kooapps is a mobile gaming studio and publisher. We have over 400M downloads across our portfolio of games with notable titles such as Snake.io, Stacky Bird and Pictoword. Our mission is to connect the world through amazing daily experiences. Join us on this journey and do the best work of our lives.",
      "imagePath": "/kooapps-logo.png"
    },
    {
      "id": 5,
      "name": "UAS",
      "Web": "https://uas.com.ph",
      "facebook": "https://www.facebook.com/OfficialUAS/",
      "twitter": "https://twitter.com/OfficialUAS",
      "instagram": "https://www.instagram.com/official.uas/",
      "intro": "With the right idea and technology, every organization has the potential to produce better business outcomes. UAS engages with companies of all sizes and our work has empowered multiple sectors and industries such as government, banking & finance, retail, real estate, telecommunications, and utility. From IT Infrastructure Services, Enterprise Applications, Value Added Services and Managed Services, Universal Access and Systems Solutions has long been a trusted name in the industry. ",
      "imagePath": "/uas-logo.png"
    }
  ]