{
  "panelists": [
    {
      "name": "Dr. Shaneth C. Ambat",
      "profession": "Computer Science Program Director",
      "intOrExt": "INTERNAL",
      "description": "Dr. Shaneth C. Ambat, the Computer Science Program Director at FEU Institute of Technology, boasts a robust academic background, including a Bachelor's and Master's in Computer Science from AMA University-Makati City, and a Ph.D. in Engineering majoring in Information Technology from Hannam University, South Korea. With over 25 years in academia and a decade as a program head and dean, she's significantly shaped curriculum delivery in various HEIs. Notable roles include being a founding Board of Trustees member for the Council of Deans of Information Technology Education – INC., NCR, and serving as a paper reviewer for national and international publications. Her career spans roles from faculty at Philippine Christian University to leadership positions at Cavite State University and St. Dominic College of Asia. Dr. Ambat's commitment to research and teaching aligns with her current role in overseeing 367 members as a Board of Trustees member for the Council of Deans for ITE-NCR, focusing on emerging trends in IT and computing.",
      "photo": "/csexpo-panelists/ambat.jpg"
    },
    {
      "name": "Ms. Beau Gray Habal",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Ms. Beau Gray Habal is a highly accomplished teacher with an impressive 19 years of experience in the field of education. Currently serving as a professor at FEU Institute of Technology, she has also taught at other universities locally and abroad. Ms. Beau's exceptional teaching skills and her dedication to providing her students with a quality education have made her a highly respected and sought-after teacher in the field of computer science.",
      "photo": "/csexpo-panelists/habal.jpg"
    },
    {
      "name": "Dr. Jennalyn G. Raviz",
      "profession": "",
      "intOrExt": "EXTERNAL",
      "description": "Dr. Jennalyn Raviz has earned her doctorate degree in Information Technology and is currently working on her dissertation for her Doctor of Philosophy in Computer Science degree. She has been an educator for almost two decades with experience teaching from Basic Education to Graduate School programs. She is a licensed teacher for secondary school Mathematics subjects. She has served as lecturer, professor and administrator for undergraduate and graduate programs for Information Technology Education in different higher education institutions. She was the pioneer administrator for the first full online institution in the country. In government service, she was handling ICT training rollout initiatives from DICT and is the current OIC-Director of the Management Information Systems Service of the DOTr.",
      "photo": "/csexpo-panelists/raviz.jpg"
    },
    {
      "name": "Mr. Abraham T. Magpantay",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Mr. Abraham Magpantay is a talented computer science professional and tech enthusiast, whose deep passion for exploring the latest advancements in technology is matched by his exceptional credentials. With a master's degree in computer science from the esteemed Ateneo de Manila University, his field of knowledge spans a range of areas, including computer vision, image processing, remote sensing, algorithms, and software engineering. Currently exercising his expertise as a faculty member and adviser for the Association for Computing Machinery (ACM) Student Chapter of FEU Tech.",
      "photo": "/csexpo-panelists/magpantay.jpg"
    },
    {
      "name": "Ms. Fanny Almeniana",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Ms. Fanny Almeniana is an Assistant Professor under the Computer Science Department of FEU Tech. She is a graduate of BS in Computer Science (BSCS) and MS in Computer Science (MSCS) from AMA Computer University, currently pursuing a Doctor of Information Technology (DIT) at La Consolacion University Philippines. The 26 years of solid occupational experiences in the industry and academe, both local and international, have been the strong foundation of her professional career. Her goal is to continuously grow in her profession, specialization, and personal attributes, and to be a vital part of the success of the institution with emphasis on education and customer service.",
      "photo": "/csexpo-panelists/almeniana.jpg"
    },
    {
      "name": "Dr. Alexen Elacio",
      "profession": "",
      "intOrExt": "EXTERNAL",
      "description": "Dr. Alexen A. Elacio has more than two decades of solid IT experience specializing in the areas of Delivery Management (Country level), IT Resource and vendor Management Quality Management, Software Quality Assurance, Software Testing for Batch Processing and  Web Application, Development, and Production Support. He has over 14 years of experience as Delivery Manager serving the United States and AMEA accounts from different industry domains such as Fresh Produce, Retail, Telco, Utilities, Healthcare, and Insurance. He has a proven track record of excellent project delivery, Proactive risk and issues management, ability to manage a team in an offshore and onshore setting with experience running Development, Software Testing, and Production Support Group. He has also experience in leading CMMI 5 and BS7799/ ISO97001 Quality Management certification. Technical expertise includes Batch mainframe system programming using MVS JCL, COBOL DB2, Software Testing. ",
      "photo": "/csexpo-panelists/elacio.jpg"
    },
    {
      "name": "Ms. Elisa V. Malasaga",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Ms. Elisa Malasaga is a graduate of Bachelor of Science in Information Science and Bachelor of Science in Computer Science both at AMA University and has graduated with Master’s degree as a Master of Science in Computer Science at AMA University. Another Masteral course – Master in Business Administration graduated at EARIST and Academic units for Doctor of Philosophy in Human Resourse Management, She passed certification from IBM – IBM Certified Rapid Application Developer 7 and IBM Certified Database2, from Microsoft- Certified Microsoft Innovative Educator Program and from Project Management Institute certified – PMI - Project Management. ",
      "photo": "/csexpo-panelists/malasaga.jpeg"
    },
    {
      "name": "Mr. John Kenneth Andales",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Mr. Andales, a dedicated Software Engineering professional, recently joined FEU TECH as a professor after completing his Bachelor's Degree in Computer Science, specializing in Software Engineering, from the same institution. His multifaceted experience includes freelance work alongside his studies, honing his skills across diverse technologies, which now inform his teaching and professional endeavors. Notably, he presented his undergraduate paper on A Mobile Messaging Application using End-to-End Encryption Technology at CS EXPO 2022. Passionate about open-source projects, Mr. Andales actively collaborates via Discord and GitHub while balancing his interests in watching Anime or Western TV Shows for relaxation. His commitment to staying updated in the field is evident through his membership in ACM throughout his undergraduate years. Highly praised by both his supervisor at Realtair Inc. and his client, RageZone, for his work ethic and software engineering expertise, Mr. Andales remains driven to further expand his knowledge and skills, channeling this enthusiasm into his teaching role at FEU TECH.",
      "photo": "/csexpo-panelists/andales.jpg"
    },
    {
      "name": "Mr. Reginald S. Cheng",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Mr. Reginald Cheng was a faculty of feutech for more than a decade, he even was a pioneer batch of East Asia College that was a former name of feutech, he is very commendable and one of the student favorites since he teaches programing and web development with different approach to the subjects.",
      "photo": "/csexpo-panelists/cheng.jpg"
    },
    {
      "name": "Dr. Hadji Tejuco",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Dr. Hadji is a educator in the field of computer science. Currently serving as a faculty member in the Computer Science Department, Dr. Tejuco has a rich educational background, marked by an  array of advanced degrees.",
      "photo": "/csexpo-panelists/tejuco.jpg"
    },
    {
      "name": "Dr. Menchita F. Dumlao",
      "profession": "",
      "intOrExt": "EXTERNAL",
      "description": "Dr. Dumlao is the Program Chair of Master of Science in Information Technology and Bachelor of Science in Information Technology and Head of Technology Integration Team. Graduate research mentoring and academic advising are the core activities and focus of her present position. Exploration of new knowledge, innovation in IT and computer science, investigation of recent literatures and research publication are some of achievements that she has contributed to PWU. She is a 21st century leader equipped with experience, knowledge and skills for emerging issues in the fourth industrial revolution, and a visionary that formulates new skill sets, strategies and new business models to gain competitive advantage.",
      "photo": "/csexpo-panelists/dumlao.png"
    },
    {
      "name": "Ms. May Florence D. San Pablo",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Ms. May San Pablo is a highly accomplished individual with a strong academic background in the field of computer science. She holds a Bachelor of Science degree in Information Technology, a Masters in Computer Education, and a Master of Science in Computer Science. Currently, she serves as a faculty member and coordinator of the Computer Science department",
      "photo": "/csexpo-panelists/san-pablo.jpg"
    },
    {
      "name": "Mr. Anthony D. Aquino",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Anthony D. Aquino is a Master of Science in Computer Science graduate and a full-time CS professor at FEU Institute of Technology. He has been in academia for almost 13 years with various certifications and research partnerships. Mr. Aquino is fascinated by the power of AI and Data Science and he loves to share in his classes. As a professor, Mr. Aquino handles subjects with embedded certification, preparing students with industry-based requirements. He is also handling mentorship to guide students in the design and development of their projects.",
      "photo": "/csexpo-panelists/aquino.jpg"
    },
    {
      "name": "Dr. Amelia Damian",
      "profession": "",
      "intOrExt": "EXTERNAL",
      "description": "Maria Amelia E. Damian, PhD IT, professor at the Department of Computer Studies and Systems, College of Engineering, University of the East. Her academic journey began at Hannam University, South Korea, where she obtained my Master in Information Technology (2002-2003) and later a PhD (2006-2014). Her dissertation explored the utilization of signcryption for machine-to-machine communication in the Philippines, laying a foundation for her research interests in Network Security, IoT, and Al.",
      "photo": "/csexpo-panelists/damian.png"
    },
    {
      "name": "Mr. Jennefer Sabonsolin",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Mr. Sabonsolin develops lesson plans, curricula, and instructional materials for computer science courses. This involves selecting appropriate textbooks, designing assignments and projects, and planning class activities. He imparts knowledge, skills and understanding related to programming and other advanced concepts in the field of computer. He experienced educator with a 13-year track record in teaching, leveraging a comprehensive background in computer science. Completing a Master's of Science in Computer Science at UP Cebu, posed to graduate later this year.",
      "photo": "/csexpo-panelists/sabonsolin.jpg"
    },
    {
      "name": "Dr. Angelo C. Arguson",
      "profession": "Computer Science Faculty",
      "intOrExt": "INTERNAL",
      "description": "Dr. Arguson is currently a Full-time Professor of the Computer Science Department at FEU Institute of Technology. He is a graduate of Bachelor of Science in Computer Science (BSCS), Master of Information Technology (MIT) at Technological University of the Philippines. His team was awarded as Best in Thesis during his BS in Computer Science final defense. His latest degree was Doctor of Information Technology (DIT) earned at University of the East Manila last July 13, 2023. His dissertation was nominated as Best Dissertation of his batch. During his teaching in tertiary levels, he was awarded for Excellence in Research last 2016.",
      "photo": "/csexpo-panelists/arguson.JPG"
    },
    {
      "name": "Dr. Jennifer Contreras",
      "profession": "",
      "intOrExt": "EXTERNAL",
      "description": "Dr. Jennifer Contreras is a founder of JOCTech ICT Consultancy and Training Services and a faculty member in the Department of Software Technology at De La Salle University - Manila. With over two decades of experience in academia, she had the privilege of teaching and connecting with students from diverse backgrounds across the globe (Libya, Sudan, Malaysia, Sweden, and the Philippines). This journey has exposed her to a rich array of beliefs, cultures, and educational backgrounds among her students. Furthermore, Doc Jen as they call her, at the Department of Information and Communications Technology is leading MOOCS and Learning Management System for reskilling and upskilling projects.",
      "photo": "/csexpo-panelists/contreras.png"
    },
    {
      "name": "Dr. Rizza G. Baltazar",
      "profession": "",
      "intOrExt": "EXTERNAL",
      "description": "Dr. Baltazar is an Associate Professor III and the Director of the Management Information Systems Office at Pampanga State Agricultural University. She holds a Doctor of Information Technology degree from Angeles University Foundation and is actively engaged in academia. Dr. Baltazar serves as a Board of Trustee for the Mechatronics and Robotics Society of the Philippines and contributes as a reviewer for prestigious conferences, including the Annual International Research Conference on IT Education by the Philippine Society of IT Educators - Region 3 and the 1st International Conference in Emerging Trends on Computing and Library Information Science at Isabela State University. Her dedication to excellence is further demonstrated by her recognition with the 2010 Presidential Lingkod Bayan Honor Award for her contributions to the Open Academy for Philippine Agriculture program. Dr. Baltazar's leadership and accomplishments solidify her as a prominent figure in the field of Information Technology and Management.",
      "photo": "/csexpo-panelists/baltazar.JPG"
    }
  ]
}
